In [2]:
import pandas as pd
import numpy as np
import os

In [3]:
customers= pd.read_csv(r'C:\Users\analy\Documents\Instacart Basket Analysis\02 Data\Original\customers.csv')

In [5]:
customers.shape

(206209, 10)

In [6]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

#### columns rename

In [12]:
customers.rename(columns={'Surnam': 'Family Name'}, inplace=True)

In [13]:
customers.rename(columns={'n_dependants': 'n_kids'}, inplace=True)

In [15]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   user_id      206209 non-null  int64
 1   First Name   194950 non-null  object
 2   Family Name  206209 non-null  object
 3   Gender       206209 non-null  object
 4   STATE        206209 non-null  object
 5   Age          206209 non-null  int64
 6   date_joined  206209 non-null  object
 7   n_kids       206209 non-null  int64
 8   fam_status   206209 non-null  object
 9   income       206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

#### columns datatype change

In [42]:
customers['user_id'].astype(str)

0          26711
1          33890
2          65803
3         125935
4         130797
           ...
206204    168073
206205     49635
206206    135902
206207     81095
206208     80148
Name: user_id, Length: 206209, dtype: object

In [43]:
customers['Age'] = pd.to_numeric(customers['Age'], downcast='unsigned')

In [44]:
customers.map(type).nunique()

user_id        1
First Name     2
Family Name    1
Gender         1
STATE          1
Age            1
date_joined    1
n_kids         1
fam_status     1
income         1
dtype: int64

#### checking for Duplicates

In [45]:
duplicates = customers[customers.duplicated(subset='user_id')]

In [46]:
duplicates

Empty DataFrame
Columns: [user_id, First Name, Family Name, Gender, STATE, Age, date_joined, n_kids, fam_status, income]
Index: []

#### Checking for missing values

In [47]:
customers.isnull().sum()

user_id            0
First Name     11259
Family Name        0
Gender             0
STATE              0
Age                0
date_joined        0
n_kids             0
fam_status         0
income             0
dtype: int64

In [48]:
customers[customers['First Name'].isnull()][['user_id', 'Family Name','First Name']]

        user_id Family Name First Name
53        76659     Gilbert        NaN
73        13738       Frost        NaN
82        89996      Dawson        NaN
99        96166     Oconnor        NaN
105       29778      Dawson        NaN
...         ...         ...        ...
206038   121317      Melton        NaN
206044   200799    Copeland        NaN
206090   167394       Frost        NaN
206162   187532       Floyd        NaN
206171   116898     Delgado        NaN

[11259 rows x 3 columns]

In [52]:
customers.to_csv(r'C:\Users\analy\Documents\Instacart Basket Analysis\02 Data\Manipulated\customers.csv')

In [4]:
pro_or= pd.read_pickle(r'C:\Users\analy\Documents\Instacart Basket Analysis\02 Data\Manipulated\ords_prods_merge.pkl')

In [13]:
complet_df= customers.merge(pro_or, on='user_id', how='left')

In [16]:
complet_df.to_pickle(r'C:\Users\analy\Documents\Instacart Basket Analysis\02 Data\Manipulated\complete_3_df.pkl')